<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Iris-Data" data-toc-modified-id="Iris-Data-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Iris Data</a></span><ul class="toc-item"><li><span><a href="#Use-the-function-defined-in-acquire.py-to-load-the-iris-data." data-toc-modified-id="Use-the-function-defined-in-acquire.py-to-load-the-iris-data.-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span><strong><font color="purple">Use the function defined in acquire.py to load the iris data.</font></strong></a></span></li><li><span><a href="#Drop-the-species_id-and-measurement_id-columns." data-toc-modified-id="Drop-the-species_id-and-measurement_id-columns.-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span><strong><font color="purple">Drop the species_id and measurement_id columns.</font></strong></a></span></li><li><span><a href="#Rename-the-species_name-column-to-just-species." data-toc-modified-id="Rename-the-species_name-column-to-just-species.-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span><strong><font color="purple">Rename the species_name column to just species.</font></strong></a></span></li><li><span><a href="#Encode-the-species-name-using-a-sklearn-label-encoder." data-toc-modified-id="Encode-the-species-name-using-a-sklearn-label-encoder.-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span><strong><font color="purple">Encode the species name using a sklearn label encoder.</font></strong></a></span></li><li><span><a href="#Create-a-function-named-prep_iris-that-accepts-the-untransformed-iris-data,-and-returns-the-data-with-the-transformations-above-applied." data-toc-modified-id="Create-a-function-named-prep_iris-that-accepts-the-untransformed-iris-data,-and-returns-the-data-with-the-transformations-above-applied.-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span><strong><font color="purple">Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.</font></strong></a></span></li></ul></li><li><span><a href="#Titanic-Data" data-toc-modified-id="Titanic-Data-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Titanic Data</a></span><ul class="toc-item"><li><span><a href="#Use-the-function-you-defined-in-acquire.py-to-load-the-titanic-data-set." data-toc-modified-id="Use-the-function-you-defined-in-acquire.py-to-load-the-titanic-data-set.-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span><strong><font color="purple">Use the function you defined in acquire.py to load the titanic data set.</font></strong></a></span></li><li><span><a href="#Handle-the-missing-values-in-the-embark_town-and-embarked-columns." data-toc-modified-id="Handle-the-missing-values-in-the-embark_town-and-embarked-columns.-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span><strong><font color="purple">Handle the missing values in the embark_town and embarked columns.</font></strong></a></span></li><li><span><a href="#Remove-the-deck-column." data-toc-modified-id="Remove-the-deck-column.-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span><strong><font color="purple">Remove the deck column.</font></strong></a></span></li><li><span><a href="#Use-a-label-encoder-to-transform-the-embarked-column." data-toc-modified-id="Use-a-label-encoder-to-transform-the-embarked-column.-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span><strong><font color="purple">Use a label encoder to transform the embarked column.</font></strong></a></span></li><li><span><a href="#Scale-the-age-and-fare-columns-using-a-min-max-scaler.-Why-might-this-be-beneficial?-When-might-you-not-want-to-do-this?" data-toc-modified-id="Scale-the-age-and-fare-columns-using-a-min-max-scaler.-Why-might-this-be-beneficial?-When-might-you-not-want-to-do-this?-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span><strong><font color="purple">Scale the age and fare columns using a min max scaler. Why might this be beneficial? When might you not want to do this?</font></strong></a></span></li><li><span><a href="#Create-a-function-named-prep_titanic-that-accepts-the-untransformed-titanic-data,-and-returns-the-data-with-the-transformations-above-applied." data-toc-modified-id="Create-a-function-named-prep_titanic-that-accepts-the-untransformed-titanic-data,-and-returns-the-data-with-the-transformations-above-applied.-2.6"><span class="toc-item-num">2.6&nbsp;&nbsp;</span><strong><font color="purple">Create a function named prep_titanic that accepts the untransformed titanic data, and returns the data with the transformations above applied.</font></strong></a></span></li><li><span><a href="#Our-function-didn't-handle-the-missing-values-in-age.-We-could-impute-the-mean-or-median-age-for-men-and-also-for-women." data-toc-modified-id="Our-function-didn't-handle-the-missing-values-in-age.-We-could-impute-the-mean-or-median-age-for-men-and-also-for-women.-2.7"><span class="toc-item-num">2.7&nbsp;&nbsp;</span>Our function didn't handle the missing values in age. We could impute the mean or median age for men and also for women.</a></span></li></ul></li></ul></div>

In [23]:
import pandas as pd
import numpy as np


import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import LabelEncoder, OneHotEncoder, MinMaxScaler

# ignore warnings
import warnings
warnings.filterwarnings("ignore")

import acquire_walkthrough

## Iris Data

### **<font color=purple>Use the function defined in acquire.py to load the iris data.</font>**

In [24]:
iris_df = acquire_walkthrough.get_iris_data()
iris_df.head(3)

,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,5.1,3.5,1.4,0.2
1,1,setosa,4.9,3.0,1.4,0.2
2,1,setosa,4.7,3.2,1.3,0.2

### **<font color=purple>Drop the species_id and measurement_id columns.</font>**

**<font color=orange>I didn't specify 'measurement_id' in my SQL query in acquire, so I don't need to drop it. Depending on YOUR query, you may need to do that here or you can adjust your SQL query in acquire.</font>**

In [25]:
iris_df.drop(columns='species_id', inplace=True)

In [26]:
iris_df.head(3)

  species_name  sepal_length  sepal_width  petal_length  petal_width
0       setosa           5.1          3.5           1.4          0.2
1       setosa           4.9          3.0           1.4          0.2
2       setosa           4.7          3.2           1.3          0.2

### **<font color=purple>Rename the species_name column to just species.</font>**

In [27]:
iris_df = iris_df.rename(columns={'species_name': 'species'})
iris_df.head(3)

  species  sepal_length  sepal_width  petal_length  petal_width
0  setosa           5.1          3.5           1.4          0.2
1  setosa           4.9          3.0           1.4          0.2
2  setosa           4.7          3.2           1.3          0.2

### **<font color=purple>Encode the species name using a sklearn label encoder.</font>**

**Research the inverse_transform method of the label encoder. How might this be useful?**

**<font color=red>First, I'm going to split my data into train and test. Why? It's good to split your data before processing it to avoid data leakage!</font>**

**Want to know more about the importance of splitting first? Check out [this article](https://towardsdatascience.com/avoid-data-leakage-split-your-data-before-processing-a7f172632b00).**

In [29]:
train, test = train_test_split(iris_df, train_size=.75, stratify=iris_df.species, random_state=123)

In [30]:
train.shape

(112, 5)

In [44]:
test.shape

(38, 5)

**<font color=purple>Now I can encode the species name using LabelEncoder.</font>**

In [45]:
le = LabelEncoder()

In [46]:
train['species'] = le.fit_transform(train.species)

In [47]:
test['species'] = le.transform(test.species)

In [48]:
train.head()

     species  sepal_length  sepal_width  petal_length  petal_width
30         0           4.8          3.1           1.6          0.2
36         0           5.5          3.5           1.3          0.2
29         0           4.7          3.2           1.6          0.2
55         1           5.7          2.8           4.5          1.3
118        2           7.7          2.6           6.9          2.3

In [49]:
test.head(1)

     species  sepal_length  sepal_width  petal_length  petal_width
135        2           7.7          3.0           6.1          2.3

### **<font color=purple>Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.</font>**

In [50]:
def prep_iris(df):
    train, test = train_test_split(df, train_size=.75, stratify=df.species, random_state=123)
    le = LabelEncoder()
    train['species'] = le.fit_transform(train[['species']])
    test['species'] = le.transform(test[['species']])
    return train, test

In [51]:
train_encoded, test_encoded = prep_iris(iris_df)

In [52]:
train_encoded.head()

     species  sepal_length  sepal_width  petal_length  petal_width
30         0           4.8          3.1           1.6          0.2
36         0           5.5          3.5           1.3          0.2
29         0           4.7          3.2           1.6          0.2
55         1           5.7          2.8           4.5          1.3
118        2           7.7          2.6           6.9          2.3

In [53]:
test_encoded.head(1)

     species  sepal_length  sepal_width  petal_length  petal_width
135        2           7.7          3.0           6.1          2.3

In [89]:
# Check our stratify on our target variable

train_encoded.species.value_counts(normalize=True)

0    0.339286
2    0.330357
1    0.330357
Name: species, dtype: float64

In [90]:
test_encoded.species.value_counts(normalize=True)

2    0.342105
1    0.342105
0    0.315789
Name: species, dtype: float64

**<font color=green>What if we want our species name back? Let's say we are done modeling, and we want to transform our encoded predictions back to easily understandable labels.</font>**

In [54]:
def inverse_encode(train_encoded, test_encoded):
    train['species'] = le.inverse_transform(train.species)
    test['species'] = le.inverse_transform(test.species)
    return train, test

In [55]:
train, test = inverse_encode(train_encoded, test_encoded)

In [56]:
train.head()

        species  sepal_length  sepal_width  petal_length  petal_width
30       setosa           4.8          3.1           1.6          0.2
36       setosa           5.5          3.5           1.3          0.2
29       setosa           4.7          3.2           1.6          0.2
55   versicolor           5.7          2.8           4.5          1.3
118   virginica           7.7          2.6           6.9          2.3

In [57]:
test.head(1)

       species  sepal_length  sepal_width  petal_length  petal_width
135  virginica           7.7          3.0           6.1          2.3

## Titanic Data

### **<font color=purple>Use the function you defined in acquire.py to load the titanic data set.</font>**

In [58]:
titanic_df = acquire_walkthrough.get_titanic_data()

In [59]:
titanic_df.head(3)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1

**<font color=red>First, I'm going to split my data into train and test.</font>**

In [61]:
t_train, t_test = train_test_split(titanic_df, train_size=.75, stratify=titanic_df.survived, random_state=123)

In [62]:
t_train.shape

(668, 13)

In [63]:
t_test.shape

(223, 13)

### **<font color=purple>Handle the missing values in the embark_town and embarked columns.</font>**

**There are a couple of ways you can do this. I'll show you two.**

In [64]:
t_train.embark_town.value_counts(dropna=False)

Southampton    481
Cherbourg      133
Queenstown      53
NaN              1
Name: embark_town, dtype: int64

In [65]:
# fill nan values with the mode

t_train['embark_town'] = t_train['embark_town'].fillna('Southampton')

In [66]:
t_train.embarked.value_counts(dropna=False)

S      481
C      133
Q       53
NaN      1
Name: embarked, dtype: int64

In [67]:
t_train['embarked'] = t_train['embarked'].fillna('S')

In [68]:
t_train.embark_town.value_counts(dropna=False)

Southampton    482
Cherbourg      133
Queenstown      53
Name: embark_town, dtype: int64

In [69]:
t_train.embarked.value_counts(dropna=False)

S    482
C    133
Q     53
Name: embarked, dtype: int64

**<font color=purple>Or using SimpleImputer</font>**

In [ ]:
# titanic_df = acquire_walkthrough.get_titanic_data()
# t_train, t_test = train_test_split(titanic_df, train_size=.75, random_state=123)

In [ ]:
# t_train.head()

In [ ]:
# imputer = SimpleImputer(strategy = 'most_frequent')
# imputer

**<font color=orange>We can now do the same on test when we get to building our function.</font>**

### **<font color=purple>Remove the deck column.</font>**

In [70]:
t_train.drop(columns=['deck'], inplace=True)

In [71]:
t_train.columns.tolist()

['passenger_id',
 'survived',
 'pclass',
 'sex',
 'age',
 'sibsp',
 'parch',
 'fare',
 'embarked',
 'class',
 'embark_town',
 'alone']

**<font color=orange>We can now do the same on test when we get to building our function.</font>**

### **<font color=purple>Use a label encoder to transform the embarked column.</font>**

In [72]:
ohe = OneHotEncoder(sparse=False, categories='auto')
t_train['embarked'] = ohe.fit_transform(t_train[['embarked']])

In [73]:
t_train.embarked.value_counts(dropna=False)

0.0    535
1.0    133
Name: embarked, dtype: int64

**<font color=orange>We can now do the same on test when we get to building our function.</font>**

### **<font color=purple>Scale the age and fare columns using a min max scaler. Why might this be beneficial? When might you not want to do this?</font>**

**<font color=red>You wouldn't want to scale these columns when you're exploring the data or trying to explain the data to others. The Scaled data can be very confusing in explanatory charts.</font>**

In [74]:
scaler = MinMaxScaler()

In [75]:
t_train[['age','fare']] = scaler.fit_transform(t_train[['age','fare']])

In [76]:
t_train.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone
683,683,0,3,male,0.184561,5,2,0.091543,0.0,Third,Southampton,0
421,421,0,3,male,0.279696,0,0,0.015094,0.0,Third,Queenstown,1
336,336,0,1,male,0.388421,1,0,0.129995,0.0,First,Southampton,0
681,681,1,1,male,0.361239,0,0,0.149765,1.0,First,Cherbourg,1
610,610,0,3,female,0.524327,1,5,0.061045,0.0,Third,Southampton,0

In [77]:
t_test[['age','fare']] = scaler.transform(t_test[['age','fare']])

In [ ]:
t_test.head(1)

### **<font color=purple>Create a function named prep_titanic that accepts the untransformed titanic data, and returns the data with the transformations above applied.</font>**

In [78]:
def prep_titanic(df):
    t_train, t_test = train_test_split(titanic_df, train_size=.75, stratify=titanic_df.survived, random_state=123)
    
    # Impute mode for embak_town Null Values
    t_train['embark_town'] = t_train['embark_town'].fillna('Southampton')
    t_test['embark_town'] = t_test['embark_town'].fillna('Southampton')
    
    # Impute Mode for embarked Null Values
    t_train['embarked'] = t_train['embarked'].fillna('S')
    t_test['embarked'] = t_test['embarked'].fillna('S')
    
    # Drop deck column, too many Null Values
    t_train.drop(columns=['deck'], inplace=True)
    t_test.drop(columns=['deck'], inplace=True)
    
    # Create, fit, and transform ohe object
    ohe = OneHotEncoder(sparse=False, categories='auto')
    t_train['embarked'] = ohe.fit_transform(t_train[['embarked']])
    t_test['embarked'] = ohe.fit_transform(t_test[['embarked']])
    
    # Create, fit, and transform scaler object
    scaler = MinMaxScaler()
    t_train[['age','fare']] = scaler.fit_transform(t_train[['age','fare']])
    t_test[['age','fare']] = scaler.transform(t_test[['age','fare']])
    return scaler, ohe, t_train, t_test

In [79]:
scaler, ohe, t_train, t_test = prep_titanic(titanic_df)

In [80]:
scaler

MinMaxScaler(copy=True, feature_range=(0, 1))

In [81]:
ohe

OneHotEncoder(categorical_features=None, categories='auto', drop=None,
              dtype=<class 'numpy.float64'>, handle_unknown='error',
              n_values=None, sparse=False)

In [82]:
t_train.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone
683,683,0,3,male,0.184561,5,2,0.091543,0.0,Third,Southampton,0
421,421,0,3,male,0.279696,0,0,0.015094,0.0,Third,Queenstown,1
336,336,0,1,male,0.388421,1,0,0.129995,0.0,First,Southampton,0
681,681,1,1,male,0.361239,0,0,0.149765,1.0,First,Cherbourg,1
610,610,0,3,female,0.524327,1,5,0.061045,0.0,Third,Southampton,0

In [86]:
# Check stratify

t_train.survived.value_counts(normalize=True)

0    0.616766
1    0.383234
Name: survived, dtype: float64

In [87]:
t_test.survived.value_counts(normalize=True)

0    0.61435
1    0.38565
Name: survived, dtype: float64

In [83]:
t_train.isna().sum()

passenger_id      0
survived          0
pclass            0
sex               0
age             131
sibsp             0
parch             0
fare              0
embarked          0
class             0
embark_town       0
alone             0
dtype: int64

In [84]:
t_test.head(1)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone
114,114,0,3,female,0.225333,0,0,0.028221,1.0,Third,Cherbourg,1

In [85]:
t_test.isna().sum()

passenger_id     0
survived         0
pclass           0
sex              0
age             46
sibsp            0
parch            0
fare             0
embarked         0
class            0
embark_town      0
alone            0
dtype: int64

### Our function didn't handle the missing values in age. We could impute the mean or median age for men and also for women.